row_data = [
    {
        'name': '推理悬疑',
        'sub_cat': [
            {'name': '日式推理'},
            {'name': '欧美探案'},
            {'name': '本土悬疑'},
            {'name': '罪案小说'},
            {'name': '恐怖惊悚'},
            {'name': '悬疑探险'},
            {'name': '灵异鬼怪'}
        ]
    },

    {
        'name': '影视原著',
        'sub_cat': [
            {'name': '热门影视'},
            {'name': '高分影视'},
            {'name': '最新播映'},
            {'name': '国产影视'},
            {'name': '海外影视'},
            {'name': '追剧指南'},
            {'name': '明星传记'}
        ]
    },

    {
        'name': '青春言情',
        'sub_cat': [
            {'name': '现代都市'},
            {'name': '情感社会'},
            {'name': '青春校园'},
            {'name': '职场青春'},
            {'name': '古代言情'},
            {'name': '穿越重生'},
            {'name': '其他'}
        ]
    },

    {
        'name': '经济管理',
        'sub_cat': [
            {'name': '商业经典'},
            {'name': '经济形势'},
            {'name': '项目管理'},
            {'name': '投资理财'},
            {'name': '财经杂志'},
            {'name': '理论学说'},
            {'name': '财会基础'}
        ]
    },

    {
        'name': '互联网+',
        'sub_cat': [
            {'name': '互联网思维'},
            {'name': 'BAT'},
            {'name': '产品人'},
            {'name': '运营之光'},
            {'name': '新零售'},
            {'name': '大数据'},
            {'name': 'IT技术书'}
        ]
    },

    {
        'name': '职场提升',
        'sub_cat': [
            {'name': '说话之道'},
            {'name': '社交之道'},
            {'name': '技能进阶'},
            {'name': '时间管理'},
            {'name': '高手经验'},
            {'name': '情商培养'}
        ]
    },

    {
        'name': '成功励志',
        'sub_cat': [
            {'name': '励志经典'},
            {'name': '商业传奇'},
            {'name': '成功哲学'},
            {'name': '励志人物'},
            {'name': '人际交往'},
            {'name': '自我提升'},
            {'name': '青年励志'}
        ]
    },
]